luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxDsadc_reg.h
/** \brief  228, Boundary Select Register */
#define DSADC_CH1_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_BOUNDSEL*)0xF0024228u)

/** Alias (User Manual Name) for DSADC_CH1_BOUNDSEL.
* To use register names with standard convension, please use DSADC_CH1_BOUNDSEL.
*/
#define	DSADC_BOUNDSEL1	(DSADC_CH1_BOUNDSEL)

/** \brief  2A0, Carrier Generator Synchronization Register */
#define DSADC_CH1_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_CGSYNC*)0xF00242A0u)

/** Alias (User Manual Name) for DSADC_CH1_CGSYNC.
* To use register names with standard convension, please use DSADC_CH1_CGSYNC.
*/
#define	DSADC_CGSYNC1	(DSADC_CH1_CGSYNC)

/** \brief  208, Demodulator Input Configuration Register */
#define DSADC_CH1_DICFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_DICFG*)0xF0024208u)

/** Alias (User Manual Name) for DSADC_CH1_DICFG.
* To use register names with standard convension, please use DSADC_CH1_DICFG.
*/
#define	DSADC_DICFG1	(DSADC_CH1_DICFG)

/** \brief  218, Filter Configuration Register, Auxiliary Filter */
#define DSADC_CH1_FCFGA /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGA*)0xF0024218u)

/** Alias (User Manual Name) for DSADC_CH1_FCFGA.
* To use register names with standard convension, please use DSADC_CH1_FCFGA.
*/
#define	DSADC_FCFGA1	(DSADC_CH1_FCFGA)

/** \brief  214, Filter Configuration Register, Main CIC Filter */
#define DSADC_CH1_FCFGC /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGC*)0xF0024214u)

/** Alias (User Manual Name) for DSADC_CH1_FCFGC.
* To use register names with standard convension, please use DSADC_CH1_FCFGC.
*/
#define	DSADC_FCFGC1	(DSADC_CH1_FCFGC)

/** \brief  210, Filter Configuration Register, Main Filter Chain */
#define DSADC_CH1_FCFGM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGM*)0xF0024210u)

/** Alias (User Manual Name) for DSADC_CH1_FCFGM.
* To use register names with standard convension, please use DSADC_CH1_FCFGM.
*/
#define	DSADC_FCFGM1	(DSADC_CH1_FCFGM)

/** \brief  220, Integration Window Control Register */
#define DSADC_CH1_IWCTR /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_IWCTR*)0xF0024220u)

/** Alias (User Manual Name) for DSADC_CH1_IWCTR.
* To use register names with standard convension, please use DSADC_CH1_IWCTR.
*/
#define	DSADC_IWCTR1	(DSADC_CH1_IWCTR)

/** \brief  200, Modulator Configuration Register */
#define DSADC_CH1_MODCFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_MODCFG*)0xF0024200u)

/** Alias (User Manual Name) for DSADC_CH1_MODCFG.
* To use register names with standard convension, please use DSADC_CH1_MODCFG.
*/
#define	DSADC_MODCFG1	(DSADC_CH1_MODCFG)

/** \brief  238, Offset Register Main Filter */
#define DSADC_CH1_OFFM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_OFFM*)0xF0024238u)

/** Alias (User Manual Name) for DSADC_CH1_OFFM.
* To use register names with standard convension, please use DSADC_CH1_OFFM.
*/
#define	DSADC_OFFM1	(DSADC_CH1_OFFM)

/** \brief  2A8, Rectification Configuration Register */
#define DSADC_CH1_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RECTCFG*)0xF00242A8u)

/** Alias (User Manual Name) for DSADC_CH1_RECTCFG.
* To use register names with standard convension, please use DSADC_CH1_RECTCFG.
*/
#define	DSADC_RECTCFG1	(DSADC_CH1_RECTCFG)

/** \brief  240, Result Register Auxiliary Filter */
#define DSADC_CH1_RESA /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RESA*)0xF0024240u)

/** Alias (User Manual Name) for DSADC_CH1_RESA.
* To use register names with standard convension, please use DSADC_CH1_RESA.
*/
#define	DSADC_RESA1	(DSADC_CH1_RESA)

/** \brief  230, Result Register Main Filter */
#define DSADC_CH1_RESM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RESM*)0xF0024230u)

/** Alias (User Manual Name) for DSADC_CH1_RESM.
* To use register names with standard convension, please use DSADC_CH1_RESM.
*/
#define	DSADC_RESM1	(DSADC_CH1_RESM)

/** \brief  250, Time-Stamp Register */
#define DSADC_CH1_TSTMP /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_TSTMP*)0xF0024250u)

/** Alias (User Manual Name) for DSADC_CH1_TSTMP.
* To use register names with standard convension, please use DSADC_CH1_TSTMP.
*/
#define	DSADC_TSTMP1	(DSADC_CH1_TSTMP)

/** \brief  328, Boundary Select Register */
#define DSADC_CH2_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_BOUNDSEL*)0xF0024328u)

/** Alias (User Manual Name) for DSADC_CH2_BOUNDSEL.
* To use register names with standard convension, please use DSADC_CH2_BOUNDSEL.
*/
#define	DSADC_BOUNDSEL2	(DSADC_CH2_BOUNDSEL)

/** \brief  3A0, Carrier Generator Synchronization Register */
#define DSADC_CH2_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_CGSYNC*)0xF00243A0u)

/** Alias (User Manual Name) for DSADC_CH2_CGSYNC.
* To use register names with standard convension, please use DSADC_CH2_CGSYNC.
*/
#define	DSADC_CGSYNC2	(DSADC_CH2_CGSYNC)

/** \brief  308, Demodulator Input Configuration Register */
#define DSADC_CH2_DICFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_DICFG*)0xF0024308u)

/** Alias (User Manual Name) for DSADC_CH2_DICFG.
* To use register names with standard convension, please use DSADC_CH2_DICFG.
*/
#define	DSADC_DICFG2	(DSADC_CH2_DICFG)

/** \brief  318, Filter Configuration Register, Auxiliary Filter */
#define DSADC_CH2_FCFGA /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGA*)0xF0024318u)

/** Alias (User Manual Name) for DSADC_CH2_FCFGA.
* To use register names with standard convension, please use DSADC_CH2_FCFGA.
*/
#define	DSADC_FCFGA2	(DSADC_CH2_FCFGA)

/** \brief  314, Filter Configuration Register, Main CIC Filter */
#define DSADC_CH2_FCFGC /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGC*)0xF0024314u)

/** Alias (User Manual Name) for DSADC_CH2_FCFGC.
* To use register names with standard convension, please use DSADC_CH2_FCFGC.
*/
#define	DSADC_FCFGC2	(DSADC_CH2_FCFGC)

/** \brief  310, Filter Configuration Register, Main Filter Chain */
#define DSADC_CH2_FCFGM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGM*)0xF0024310u)

/** Alias (User Manual Name) for DSADC_CH2_FCFGM.
* To use register names with standard convension, please use DSADC_CH2_FCFGM.
*/
#define	DSADC_FCFGM2	(DSADC_CH2_FCFGM)

/** \brief  320, Integration Window Control Register */
#define DSADC_CH2_IWCTR /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_IWCTR*)0xF0024320u)

/** Alias (User Manual Name) for DSADC_CH2_IWCTR.
* To use register names with standard convension, please use DSADC_CH2_IWCTR.
*/
#define	DSADC_IWCTR2	(DSADC_CH2_IWCTR)

/** \brief  300, Modulator Configuration Register */
#define DSADC_CH2_MODCFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_MODCFG*)0xF0024300u)

/** Alias (User Manual Name) for DSADC_CH2_MODCFG.
* To use register names with standard convension, please use DSADC_CH2_MODCFG.
*/
#define	DSADC_MODCFG2	(DSADC_CH2_MODCFG)

/** \brief  338, Offset Register Main Filter */
#define DSADC_CH2_OFFM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_OFFM*)0xF0024338u)

/** Alias (User Manual Name) for DSADC_CH2_OFFM.
* To use register names with standard convension, please use DSADC_CH2_OFFM.
*/
#define	DSADC_OFFM2	(DSADC_CH2_OFFM)

/** \brief  3A8, Rectification Configuration Register */
#define DSADC_CH2_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RECTCFG*)0xF00243A8u)

