luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxDsadc_reg.h
/** Alias (User Manual Name) for DSADC_CH4_FCFGA.
* To use register names with standard convension, please use DSADC_CH4_FCFGA.
*/
#define	DSADC_FCFGA4	(DSADC_CH4_FCFGA)

/** \brief  514, Filter Configuration Register, Main CIC Filter */
#define DSADC_CH4_FCFGC /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGC*)0xF0024514u)

/** Alias (User Manual Name) for DSADC_CH4_FCFGC.
* To use register names with standard convension, please use DSADC_CH4_FCFGC.
*/
#define	DSADC_FCFGC4	(DSADC_CH4_FCFGC)

/** \brief  510, Filter Configuration Register, Main Filter Chain */
#define DSADC_CH4_FCFGM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGM*)0xF0024510u)

/** Alias (User Manual Name) for DSADC_CH4_FCFGM.
* To use register names with standard convension, please use DSADC_CH4_FCFGM.
*/
#define	DSADC_FCFGM4	(DSADC_CH4_FCFGM)

/** \brief  520, Integration Window Control Register */
#define DSADC_CH4_IWCTR /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_IWCTR*)0xF0024520u)

/** Alias (User Manual Name) for DSADC_CH4_IWCTR.
* To use register names with standard convension, please use DSADC_CH4_IWCTR.
*/
#define	DSADC_IWCTR4	(DSADC_CH4_IWCTR)

/** \brief  500, Modulator Configuration Register */
#define DSADC_CH4_MODCFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_MODCFG*)0xF0024500u)

/** Alias (User Manual Name) for DSADC_CH4_MODCFG.
* To use register names with standard convension, please use DSADC_CH4_MODCFG.
*/
#define	DSADC_MODCFG4	(DSADC_CH4_MODCFG)

/** \brief  538, Offset Register Main Filter */
#define DSADC_CH4_OFFM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_OFFM*)0xF0024538u)

/** Alias (User Manual Name) for DSADC_CH4_OFFM.
* To use register names with standard convension, please use DSADC_CH4_OFFM.
*/
#define	DSADC_OFFM4	(DSADC_CH4_OFFM)

/** \brief  5A8, Rectification Configuration Register */
#define DSADC_CH4_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RECTCFG*)0xF00245A8u)

/** Alias (User Manual Name) for DSADC_CH4_RECTCFG.
* To use register names with standard convension, please use DSADC_CH4_RECTCFG.
*/
#define	DSADC_RECTCFG4	(DSADC_CH4_RECTCFG)

/** \brief  540, Result Register Auxiliary Filter */
#define DSADC_CH4_RESA /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RESA*)0xF0024540u)

/** Alias (User Manual Name) for DSADC_CH4_RESA.
* To use register names with standard convension, please use DSADC_CH4_RESA.
*/
#define	DSADC_RESA4	(DSADC_CH4_RESA)

/** \brief  530, Result Register Main Filter */
#define DSADC_CH4_RESM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RESM*)0xF0024530u)

/** Alias (User Manual Name) for DSADC_CH4_RESM.
* To use register names with standard convension, please use DSADC_CH4_RESM.
*/
#define	DSADC_RESM4	(DSADC_CH4_RESM)

/** \brief  550, Time-Stamp Register */
#define DSADC_CH4_TSTMP /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_TSTMP*)0xF0024550u)

/** Alias (User Manual Name) for DSADC_CH4_TSTMP.
* To use register names with standard convension, please use DSADC_CH4_TSTMP.
*/
#define	DSADC_TSTMP4	(DSADC_CH4_TSTMP)

/** \brief  628, Boundary Select Register */
#define DSADC_CH5_BOUNDSEL /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_BOUNDSEL*)0xF0024628u)

/** Alias (User Manual Name) for DSADC_CH5_BOUNDSEL.
* To use register names with standard convension, please use DSADC_CH5_BOUNDSEL.
*/
#define	DSADC_BOUNDSEL5	(DSADC_CH5_BOUNDSEL)

/** \brief  6A0, Carrier Generator Synchronization Register */
#define DSADC_CH5_CGSYNC /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_CGSYNC*)0xF00246A0u)

/** Alias (User Manual Name) for DSADC_CH5_CGSYNC.
* To use register names with standard convension, please use DSADC_CH5_CGSYNC.
*/
#define	DSADC_CGSYNC5	(DSADC_CH5_CGSYNC)

/** \brief  608, Demodulator Input Configuration Register */
#define DSADC_CH5_DICFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_DICFG*)0xF0024608u)

/** Alias (User Manual Name) for DSADC_CH5_DICFG.
* To use register names with standard convension, please use DSADC_CH5_DICFG.
*/
#define	DSADC_DICFG5	(DSADC_CH5_DICFG)

/** \brief  618, Filter Configuration Register, Auxiliary Filter */
#define DSADC_CH5_FCFGA /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGA*)0xF0024618u)

/** Alias (User Manual Name) for DSADC_CH5_FCFGA.
* To use register names with standard convension, please use DSADC_CH5_FCFGA.
*/
#define	DSADC_FCFGA5	(DSADC_CH5_FCFGA)

/** \brief  614, Filter Configuration Register, Main CIC Filter */
#define DSADC_CH5_FCFGC /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGC*)0xF0024614u)

/** Alias (User Manual Name) for DSADC_CH5_FCFGC.
* To use register names with standard convension, please use DSADC_CH5_FCFGC.
*/
#define	DSADC_FCFGC5	(DSADC_CH5_FCFGC)

/** \brief  610, Filter Configuration Register, Main Filter Chain */
#define DSADC_CH5_FCFGM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_FCFGM*)0xF0024610u)

/** Alias (User Manual Name) for DSADC_CH5_FCFGM.
* To use register names with standard convension, please use DSADC_CH5_FCFGM.
*/
#define	DSADC_FCFGM5	(DSADC_CH5_FCFGM)

/** \brief  620, Integration Window Control Register */
#define DSADC_CH5_IWCTR /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_IWCTR*)0xF0024620u)

/** Alias (User Manual Name) for DSADC_CH5_IWCTR.
* To use register names with standard convension, please use DSADC_CH5_IWCTR.
*/
#define	DSADC_IWCTR5	(DSADC_CH5_IWCTR)

/** \brief  600, Modulator Configuration Register */
#define DSADC_CH5_MODCFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_MODCFG*)0xF0024600u)

/** Alias (User Manual Name) for DSADC_CH5_MODCFG.
* To use register names with standard convension, please use DSADC_CH5_MODCFG.
*/
#define	DSADC_MODCFG5	(DSADC_CH5_MODCFG)

/** \brief  638, Offset Register Main Filter */
#define DSADC_CH5_OFFM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_OFFM*)0xF0024638u)

/** Alias (User Manual Name) for DSADC_CH5_OFFM.
* To use register names with standard convension, please use DSADC_CH5_OFFM.
*/
#define	DSADC_OFFM5	(DSADC_CH5_OFFM)

/** \brief  6A8, Rectification Configuration Register */
#define DSADC_CH5_RECTCFG /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RECTCFG*)0xF00246A8u)

/** Alias (User Manual Name) for DSADC_CH5_RECTCFG.
* To use register names with standard convension, please use DSADC_CH5_RECTCFG.
*/
#define	DSADC_RECTCFG5	(DSADC_CH5_RECTCFG)

/** \brief  640, Result Register Auxiliary Filter */
#define DSADC_CH5_RESA /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RESA*)0xF0024640u)

/** Alias (User Manual Name) for DSADC_CH5_RESA.
* To use register names with standard convension, please use DSADC_CH5_RESA.
*/
#define	DSADC_RESA5	(DSADC_CH5_RESA)

/** \brief  630, Result Register Main Filter */
#define DSADC_CH5_RESM /*lint --e(923)*/ (*(volatile Ifx_DSADC_CH_RESM*)0xF0024630u)

/** Alias (User Manual Name) for DSADC_CH5_RESM.
* To use register names with standard convension, please use DSADC_CH5_RESM.
*/
#define	DSADC_RESM5	(DSADC_CH5_RESM)

